<template>
  <div>
    <v-container class="rule-box">
      <v-row>
        <v-col cols="12">
          <h3 class="my-2">قوانین عمومی :</h3>
          <ul>
            <li class="py-2">
              خانه طلا در راستای افزایش ضریب امنیت حساب‌ها و معاملات، تکمیل
              فرایند احراز هویت را برای تمامی کاربرانی که قصد ایجاد حساب کاربری،
              خرید و فروش و برداشت طلا را دارند، الزامی در نظر گرفته است.
            </li>
            <li class="py-2">
              هدف اصلی از احراز هویت، ایجاد محیطی امن برای حفظ اطلاعات فردی و
              هویتی کاربران در پنل کاربری است. به جهت جلوگیری از هر گونه
              کلاهبرداری و پولشویی، هر کاربر جهت شروع معاملات خود در سامانه خانه
              طلا، موظف به احراز هویت می باشد.
            </li>
            <li class="py-2">
              تمامی فعالیت‌ھای سایت خانه طلا در چارچوب قوانین جمھوری اسلامی
              ایران است و استفاده از خدمات خانه طلا، اعم از ثبت نام، خرید و فروش
              طلا، بر مبنای مطالعه‌ی دقیق و پذیرش قوانین آن است.
            </li>
            <li class="py-2">
              كاربران خانه طلا متعھد می‌شوند که با بازار طلا آشنا ھستند و با
              وجود ریسک‌ھای مربوط به سرمایه‌گذاری در این حوزه، با علم و آگاھی
              کامل اقدام به سرمایه‌گذاری می‌نمایند و سود و زیان ناشی از ھرگونه
              فعالیت كاربر درسامانه خانه طلا برعھده خود کاربر میباشد.
            </li>
            <li class="py-2">
              خانه طلا این حق را برای خود محفوظ می داند که کلیه معاملات مشکوک به
              سوء استفاده از سیستم را به مقامات قضائی اعلام دارد تا تحت پیگرد
              قانونی قرار گیرند.
            </li>
            <li class="py-2">
              مسئولیت نگهداری رمزعبور بر عهده کاربر بوده و هیچ گونه مسئولیتی
              درقبال خسارت و زیانهای وارده به مشتریان در اثر افشای رمز عبور
              متوجه خانه طلا نیست.
            </li>
            <li class="py-2">
              فوت یا مفقودی صاحب حساب کاربری موجب مسدود شدن پنل کاربری میشود و
              پس از طی مراحل قانونی وجه حساب مسدودی به وارث یا قیم وی مسترد
              میگردد.
            </li>
            <li class="py-2">
              تمام قوانین و مقرارت در شرایط عادی برقرار است و در صورت بروز حوادث
              متفرقه یا هرگونه از موارد قوه قهریه، هیچ مسئولیتی متوجه سامانه
              خانه طلا نیست.
            </li>
          </ul>
          <h3 class="my-2">قوانین احراز هویت :</h3>
          <ul>
            <li class="py-2">
              به‌ منظور انجام مراحل احراز هویت درخانه طلا، اطلاعاتی از قبیل
              اطلاعات هویتی شماره شناسنامه و کدملی، نام و نام خانوادگی، تاریخ
              تولد، کارت بانکی و شماره شبا مورد نیاز است .
            </li>
            <li class="py-2">
              هر کد ملی امکان ایجاد فقط یک حساب کاربری در سامانه خانه طلا را
              دارد.
            </li>
            <li class="py-2">
              کاربر این حق را به خانه طلا می‌دهد که در تماس‌های تلفنی، کارشناس
              خانه طلا اطلاعات هویتی شخص را جهت احراز هویت دریافت نماید.
            </li>
            <li class="py-2">
              هرگونه استفاده از اطلاعات ثبت‌نامی به وسیله فرد دیگر یا اشخاص ثالث
              به شدت ممنوع است. کاربر موظف است که بلافاصله خانه طلا را از هرگونه
              استفاده غیر مجاز از رمز عبور خود یا هرگونه نقص امنیتی مطلع سازد.
            </li>
          </ul>
          <h3 class="my-2">قوانین ومقرارت واریز و دریافت وجه :</h3>
          <ul>
            <li class="py-2">
              تسویه ریالی در سامانه خانه طلا فقط به حساب های احراز شده در پنل
              کاربری امکان پذیر می باشد.
            </li>
            <li class="py-2">
              سقف تسویه ریالی روزانه برای کاربران سطح یک، 500 میلیون ریال
              میباشد.
            </li>
            <li class="py-2">
              به طور معمول در 24 ساعت اولیه درخواست تسویه، مبلغ به حساب کاربر
              پایا می شود ولی با درنظر گرفتن تعطیلی ها و حوادث غیرمترقبه ، 96
              ساعت کاری (4 روز کاری ) حداکثر زمان تسویه در نظر گرفته شداست.
            </li>
            <li class="py-2">
              امکان تحویل فیزیکی تنها از طریق ثبت سیستمی در سامانه امکان پذیر
              است و فقط کدپستی احراز شده در سامانه مبنای ارسال می باشد.
            </li>
          </ul>
          <h3 class="my-2">قوانین مربوط به خرید و فروش :</h3>
          <ul>
            <li class="py-2">
              سقف معاملات روزانه در سامانه خانه طلا 10 گرم می باشد.
            </li>
            <li class="py-2">
              عملیات خرید و فروش نیازمند تایید مدیر معاملات می باشد و ممکن است
              پس از یک الی دو روز کاری تایید گردد. با توجه به ظرفیت بازار, حق
              تایید و یا عدم تایید معامله برای مدیر معاملات محفوظ می باشد.
            </li>
            <li class="py-2">
              چهارشنبه آخرین روز کاری هفته می باشد. و درخواست های تسویه روز
              پنجشنبه به شنبه آتی موکول می شود.
            </li>
            <li class="py-2">احراز کامل هویتی پیش شرط انجام معاملات شماست.</li>
          </ul>
          <h3 class="my-2">حریم خصوصی :</h3>
          <ul>
            <li class="py-2">
              سامانه خانه طلا، با تاکید بر حفظ حریم خصوصی کاربران خود، هویت شخصی
              کاربران را محرمانه می‌داند و اطلاعات شخصی آنان را به هیچ شخص یا
              سازمان دیگری منتقل نمی‌کند، مگر اینکه با حکم مقام قضائی یا طبق
              قوانین و مقررات رایج کشور موظف باشد در اختیار مراجع ذی‌صلاح قرار
              دهد.
            </li>
            <li class="py-2">
              خانه طلا برای حفاظت و نگهداری اطلاعات و حریم شخصی کاربران همه توان
              خود را به کار می‌گیرد و امیدوار است که تجربه معامله ای امن، راحت و
              خوشایند را برای همه کاربران فراهم آورد.
            </li>
            <li class="py-2">
              همچنین بدین وسیله به اطلاع کاربران رسانده می‌شود که خانه طلا
              همانند سایر وب سایت‌ها از جمع آوری IP و کوکی‌ها استفاده می‌کند،
              اما پروتکل، سرور و لایه‌های امنیتی خانه طلا و روش‌های مناسب مدیریت
              داده‌ها حداکثر تلاش را به عمل می‌آورد که اطلاعات کاربران را محافظت
              و از دسترسی‌های غیر قانونی جلوگیری کند. طبیعتا مسئولیت هرگونه سوء
              استفاده به شخص یا اشخاص متخلف مربوط بوده و خانه طلا حق اعتراض و
              پیگیری را از طریق قانونی بنابر صلاحدید خود محفوظ می‌دارد.
            </li>
            <!-- <li class="py-2">
              توجه داشته باشید که سرخط 02154187 شماره‌ ای است که خانه طلا از طریق
              آن برای کاربران و مشتریان خود (اس‌ام‌اس) ارسال می‌کند. این
              شماره‌‌، سامانه ارسال پیامک است که وضعیت معاملات یا رویدادها،
              خدمات و سرویس‌های ویژه خانه طلا را به اطلاع کاربران می‌رساند و روشن
              است که امکان دریافت پیام‌های شما از طریق آن وجود ندارد، بنابراین
              ارسال هرگونه پیامک تحت عنوان خانه طلا، با هر شماره دیگری تخلف و سوء
              استفاده از نام خانه طلا است و در صورت دریافت چنین پیامکی، لطفاً جهت
              پیگیری قانونی آن را به ما اطلاع دهید.
            </li> -->
          </ul>
        </v-col>
      </v-row>
      <v-row>
        <v-col cols="12">
          <div class="d-flex justify-end">
            <v-btn @click="backIdentity" color="#B0863B" block>بازگشت</v-btn>
          </div>
        </v-col>
      </v-row>
    </v-container>
  </div>
</template>

<script setup>
import router from "@/router";

const backIdentity = () => {
  router.replace("/Identity");
};
</script>

<style scoped>
.rule-box {
  position: relative;
  min-height: 100vh;
}

.rule-box::before {
  content: "";
  position: absolute;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-image: url(/src/assets/logo.svg);
  background-repeat: no-repeat;
  background-position: center;
  background-size: 30% auto; /* اندازه مناسب برای لوگو */
  opacity: 0.1; /* مقدار opacity کمتر برای خوانایی بهتر */
  z-index: 0; /* قرارگیری زیر محتوا */
}
</style>
